/**
 * 0 正确返回
 * 1001 请求参数错误
 * 1003 参数重复
 * 1006 文件格式不正确
 * 1007 密码强度不符合规定
 * 2001 注册手机号与接受验证码手机号不一致
 * 2002 验证码失效
 * 2003 验证码错误
 * 2004 用户不存在
 * 2005 手机号不正确
 * 2008 用户被禁止登录
 * 2009 修改密码时候原密码错误
 * 2010 注测的用户名称不允许包含guest
 * 4001 无权限
 * 
 */
export type ResponseWrapper<T = unknown> = {
  code:
    | 0
    | 1001
    | 1003
    | 1006
    | 1007
    | 2001
    | 2002
    | 2003
    | 2004
    | 2005
    | 2008
    | 2009
    | 2010
    | 4001
    | 4002
    | 4004
    | 4005
    | 5000
    | 101001
    | 101002
    | 101003
    | 101004
    | 101005;
  msg: string;
  data?: T;
};

export type TableResponseWrapper<T = unknown> = {
  rows: T[];
  total: number;
};
